stm32-rs/stm32f4xx-hal/src/adc.rs
                /// Returns the current sample stored in the ADC data register
                pub fn current_sample(&self) -> u16 {
                    self.adc_reg.dr.read().data().bits()
                }

                /// Converts a sample value to millivolts using calibrated VDDA and configured resolution
                pub fn sample_to_millivolts(&self, sample: u16) -> u16 {
                    ((u32::from(sample) * self.calibrated_vdda) / self.max_sample) as u16
                }

                /// Converts a f32 sample value to millivolts using calibrated VDDA and configured resolution
                ///
                /// Useful when averaging multiple samples
                pub fn sample_to_millivolts_f(&self, sample: f32) -> f32 {
                    (sample * (self.calibrated_vdda as f32)) / (self.max_sample as f32)
                }

                /// Block until the conversion is completed
                /// # Panics
                /// Will panic if there is no conversion started and the end-of-conversion bit is not set
                pub fn wait_for_conversion_sequence(&self) {
                    if !self.adc_reg.sr.read().strt().bit_is_set() && !self.adc_reg.sr.read().eoc().bit_is_set() {
                        panic!("Waiting for end-of-conversion but no conversion started");
                    }
                    while !self.adc_reg.sr.read().eoc().bit_is_set() {}
                    //Clear the conversion started flag
                    self.adc_reg.sr.modify(|_, w| w.strt().clear_bit());
                }

                /// Synchronously convert a single sample
                /// Note that it reconfigures the adc sequence and doesn't restore it
                pub fn convert<PIN>(&mut self, pin: &PIN, sample_time: config::SampleTime) -> u16
                where
                    PIN: Channel<stm32::$adc_type, ID=u8>
                {
                    self.adc_reg.cr2.modify(|_, w| w
                        .dma().clear_bit() //Disable dma
                        .cont().clear_bit() //Disable continuous mode
                        .exten().bits(config::TriggerMode::Disabled.into()) //Disable trigger
                        .eocs().clear_bit() //EOC is set at the end of the sequence
                    );
                    self.adc_reg.cr1.modify(|_, w| w
                        .scan().clear_bit() //Disable scan mode
                        .eocie().clear_bit() //Disable end of conversion interrupt
                    );
                    // Disable multi-mode to prevent DMA being triggered
                    self.set_multi_mode(Some((
                        config::AdcMultiMode::INDEPENDENT,
                        config::DmaMultiDds::SINGLE,
                        config::DmaMultiMode::DISABLED,
                    )));

                    self.reset_sequence();
                    self.configure_channel(pin, config::Sequence::One, sample_time);
                    self.enable();
                    self.clear_end_of_conversion_flag();
                    self.start_conversion();

                    //Wait for the sequence to complete
                    self.wait_for_conversion_sequence();

                    let result = self.current_sample();

                    //Reset the config
                    self.apply_config(self.config);

                    result
                }
            }

            impl<PIN> OneShot<stm32::$adc_type, u16, PIN> for Adc<stm32::$adc_type>
            where
                PIN: Channel<stm32::$adc_type, ID=u8>,
            {
                type Error = ();

                fn read(&mut self, pin: &mut PIN) -> nb::Result<u16, Self::Error> {
                    let enabled = self.is_enabled();
                    if !enabled {
                        self.enable();
                    }

                    let sample = self.convert(pin, self.config.default_sample_time);

                    if !enabled {
                        self.disable();
                    }

                    Ok(sample)
                }
            }
        )+
    };
}

macro_rules! adc_calibrate {
    ($( $adc_type:ident => (
        $constructor_fn_name:ident,
        $common_type:ident,
        $rcc_enr_reg:ident,
        $rcc_enr_field: ident,
        $rcc_rst_reg: ident,
        $rcc_rst_field: ident
    )),+ $(,)*) => {
        $(
            impl Adc<stm32::$adc_type> {
                /// Calculates the ADC calibration sampling the internal VREF channel and comparing
                /// the result with the value stored at the factory.
                ///
                /// **Doesn't** apply the calibration to the adc instance. Use [apply_calibration](#method.apply_calibration)
                /// to apply it.
                ///
                /// None that the calibration can only be calculated on ADC1 as the internal VREF isn't hooked
                /// up to the other ADCs. The factory calibration value is also only a single calibration value.
                ///
                /// `samples` parameter determines how many times to sample and average the result
                pub fn calculate_calibration(&mut self, samples: usize) -> Calibration {
                    self.enable();

                    if samples == 0 {
                        return Calibration {
                            calibrated_vdda: VDDA_CALIB,
                            _reserved: (),
                        };
                    }

                    assert!((samples as u64 * 4096) < core::u64::MAX);

                    // Get the factory stored sample for the internal vref.
                    // The internal vref is ~1.2V and is sampled with a VDDA of 3.3V.
                    // Using this and a new sample for the internal vref we can calculate what our
                    // vdda really is.
                    let vref_cal = VrefCal::get().read() as u32;

                    let vref_en = self.temperature_and_vref_enabled();
                    if !vref_en {
                        self.enable_temperature_and_vref();
                    }

                    let mut vref_samp = 0;
                    for _ in 0..samples {
                        // Unwrap is ok, error type is Infallible
                        vref_samp += self.read(&mut Vref).unwrap() as u64;
                    }
                    let vref_samp = (vref_samp / samples as u64) as u32;

                    if !vref_en {
                        self.disable_temperature_and_vref();
                    }

                    Calibration {
                        calibrated_vdda: (VDDA_CALIB * vref_cal) / vref_samp,
                        _reserved: (),
                    }
                }
            }
        )+
    };
}

#[cfg(any(
    feature = "stm32f401", feature = "stm32f405", feature = "stm32f415", feature = "stm32f407",
    feature = "stm32f417", feature = "stm32f410", feature = "stm32f411", feature = "stm32f412",
    feature = "stm32f413", feature = "stm32f423", feature = "stm32f427", feature = "stm32f437",
    feature = "stm32f429", feature = "stm32f439", feature = "stm32f446", feature = "stm32f469",
    feature = "stm32f479",
))]
adc!(ADC1 => (adc1, ADC_COMMON, apb2enr, adc1en, apb2rstr, adcrst));
adc_calibrate!(ADC1 => (adc1, ADC_COMMON, apb2enr, adc1en, apb2rstr, adcrst));

#[cfg(any(
    feature = "stm32f405", feature = "stm32f415", feature = "stm32f407", feature = "stm32f417",
    feature = "stm32f427", feature = "stm32f437", feature = "stm32f429", feature = "stm32f439",
    feature = "stm32f446", feature = "stm32f469", feature = "stm32f479",
))]
adc!(ADC2 => (adc2, ADC_COMMON, apb2enr, adc2en, apb2rstr, adcrst));

#[cfg(any(
    feature = "stm32f405", feature = "stm32f415", feature = "stm32f407", feature = "stm32f417",
    feature = "stm32f427", feature = "stm32f437", feature = "stm32f429", feature = "stm32f439",
    feature = "stm32f446", feature = "stm32f469", feature = "stm32f479",
))]
adc!(ADC3 => (adc3, ADC_COMMON, apb2enr, adc3en, apb2rstr, adcrst));



#[cfg(feature = "stm32f401")]
adc_pins!(
    gpioa::PA0<Analog> => (ADC1, 0),
    gpioa::PA1<Analog> => (ADC1, 1),
    gpioa::PA2<Analog> => (ADC1, 2),
    gpioa::PA3<Analog> => (ADC1, 3),
    gpioa::PA4<Analog> => (ADC1, 4),
    gpioa::PA5<Analog> => (ADC1, 5),
    gpioa::PA6<Analog> => (ADC1, 6),
    gpioa::PA7<Analog> => (ADC1, 7),
    gpiob::PB0<Analog> => (ADC1, 8),
    gpiob::PB1<Analog> => (ADC1, 9),
    Temperature => (ADC1, 18),
    Vbat => (ADC1, 18),
    Vref => (ADC1, 17),
);

// Not available on C variant
#[cfg(feature = "stm32f401")]
adc_pins!(
    gpioc::PC0<Analog> => (ADC1, 10),
    gpioc::PC1<Analog> => (ADC1, 11),
    gpioc::PC2<Analog> => (ADC1, 12),
    gpioc::PC3<Analog> => (ADC1, 13),
    gpioc::PC4<Analog> => (ADC1, 14),
    gpioc::PC5<Analog> => (ADC1, 15),
);

#[cfg(any(feature = "stm32f405", feature = "stm32f415"))]
adc_pins!(
    gpioa::PA0<Analog> => (ADC1, 0),
    gpioa::PA0<Analog> => (ADC2, 0),
    gpioa::PA0<Analog> => (ADC3, 0),
    gpioa::PA1<Analog> => (ADC1, 1),
    gpioa::PA1<Analog> => (ADC2, 1),
    gpioa::PA1<Analog> => (ADC3, 1),
    gpioa::PA2<Analog> => (ADC1, 2),
    gpioa::PA2<Analog> => (ADC2, 2),
    gpioa::PA2<Analog> => (ADC3, 2),
    gpioa::PA3<Analog> => (ADC1, 3),
    gpioa::PA3<Analog> => (ADC2, 3),
    gpioa::PA3<Analog> => (ADC3, 3),
    gpioa::PA4<Analog> => (ADC1, 4),
    gpioa::PA4<Analog> => (ADC2, 4),
    gpioa::PA5<Analog> => (ADC1, 5),
    gpioa::PA5<Analog> => (ADC2, 5),
    gpioa::PA6<Analog> => (ADC1, 6),
    gpioa::PA6<Analog> => (ADC2, 6),
    gpioa::PA7<Analog> => (ADC1, 7),
    gpioa::PA7<Analog> => (ADC2, 7),
    gpiob::PB0<Analog> => (ADC1, 8),
    gpiob::PB0<Analog> => (ADC2, 8),
    gpiob::PB1<Analog> => (ADC1, 9),
    gpiob::PB1<Analog> => (ADC2, 9),
    gpioc::PC0<Analog> => (ADC1, 10),
    gpioc::PC0<Analog> => (ADC2, 10),
    gpioc::PC0<Analog> => (ADC3, 10),
    gpioc::PC2<Analog> => (ADC1, 12),
    gpioc::PC2<Analog> => (ADC2, 12),
    gpioc::PC2<Analog> => (ADC3, 12),
    gpioc::PC3<Analog> => (ADC1, 13),
    gpioc::PC3<Analog> => (ADC2, 13),
    gpioc::PC3<Analog> => (ADC3, 13),
    Temperature => (ADC1, 18),
    Vbat => (ADC1, 18),
    Vref => (ADC1, 17),
);

// Not available on O variant
#[cfg(any(feature = "stm32f405", feature = "stm32f415"))]
adc_pins!(
    gpioc::PC1<Analog> => (ADC1, 11),
    gpioc::PC1<Analog> => (ADC2, 11),
    gpioc::PC1<Analog> => (ADC3, 11),
    gpioc::PC4<Analog> => (ADC1, 14),
    gpioc::PC4<Analog> => (ADC2, 14),
    gpioc::PC5<Analog> => (ADC1, 15),
    gpioc::PC5<Analog> => (ADC2, 15),
    gpiof::PF10<Analog> => (ADC3, 8),
    gpiof::PF3<Analog> => (ADC3, 9),
    gpiof::PF4<Analog> => (ADC3, 14),
    gpiof::PF5<Analog> => (ADC3, 15),
    gpiof::PF6<Analog> => (ADC3, 4),
    gpiof::PF7<Analog> => (ADC3, 5),
    gpiof::PF8<Analog> => (ADC3, 6),
    gpiof::PF9<Analog> => (ADC3, 7),
);

